In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
import warnings
warnings.filterwarnings('ignore')

`Semua Data Baru harus melalui Step yg sama dengan yg dilalui oleh X_train
atau harus dalam Format yang sama`

In [4]:
df = pd.read_csv('train (1).csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
df_titanic = df[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked', 'Survived']]

In [8]:
df_titanic.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0       3    male  22.0      1      0   7.2500        S         0
1       1  female  38.0      1      0  71.2833        C         1
2       3  female  26.0      0      0   7.9250        S         1
3       1  female  35.0      1      0  53.1000        S         1
4       3    male  35.0      0      0   8.0500        S         0

In [9]:
df_titanic.isna().sum()

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
Survived      0
dtype: int64

In [10]:
### Splitting Data

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
X = df_titanic.drop(columns='Survived')
y = df_titanic['Survived']

In [13]:
X_train, X_test, y_train, y_test = train_test_split(X, y, stratify=y, train_size = .8, random_state=42)

In [14]:
X_train.head()

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
692       3    male   NaN      0      0   56.4958        S
481       2    male   NaN      0      0    0.0000        S
527       1    male   NaN      0      0  221.7792        S
855       3  female  18.0      0      1    9.3500        S
801       2  female  31.0      1      1   26.2500        S

In [15]:
cat_columns = ['Sex', 'Embarked', 'Pclass']

num_columns = ['Age', 'SibSp', 'Parch', 'Fare']

In [16]:
from sklearn.pipeline import Pipeline
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder, LabelEncoder, MinMaxScaler, StandardScaler, RobustScaler

In [17]:
numerical_pipeline = Pipeline([
    ('imputer', SimpleImputer(strategy='mean')),
    ('scaler', RobustScaler())
])





categorical_pipeline = Pipeline([
    ('imputer', SimpleImputer(strategy='most_frequent')),
    ('encoder', OneHotEncoder())
])

In [18]:
scaler = RobustScaler()

In [19]:
X_train_num = numerical_pipeline.fit_transform(X_train[num_columns])

In [20]:
X_train_num

array([[ 0.        ,  0.        ,  0.        ,  1.81965184],
       [ 0.        ,  0.        ,  0.        , -0.6256092 ],
       [ 0.        ,  0.        ,  0.        ,  8.97347668],
       ...,
       [ 1.29945093,  1.        ,  3.        ,  0.86221553],
       [ 1.22802236,  0.        ,  0.        ,  1.04075449],
       [ 0.        ,  0.        ,  0.        ,  0.52353252]])

In [21]:
X_train_cat = categorical_pipeline.fit_transform(X_train[cat_columns])

In [22]:
X_train_cat.toarray()

array([[0., 1., 0., ..., 0., 0., 1.],
       [0., 1., 0., ..., 0., 1., 0.],
       [0., 1., 0., ..., 1., 0., 0.],
       ...,
       [1., 0., 0., ..., 0., 0., 1.],
       [0., 1., 0., ..., 1., 0., 0.],
       [0., 1., 0., ..., 1., 0., 0.]])

In [23]:
from sklearn.compose import ColumnTransformer

In [24]:
preprocessor = ColumnTransformer([
    ('numeric', numerical_pipeline, num_columns),
    ('categorical', categorical_pipeline, cat_columns)
])

In [25]:
X_train.head()

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
692       3    male   NaN      0      0   56.4958        S
481       2    male   NaN      0      0    0.0000        S
527       1    male   NaN      0      0  221.7792        S
855       3  female  18.0      0      1    9.3500        S
801       2  female  31.0      1      1   26.2500        S

In [26]:
X_train.isna().sum()

Pclass        0
Sex           0
Age         137
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [27]:
X_train_prep = preprocessor.fit_transform(X_train)

In [28]:
X_test_prep = preprocessor.fit_transform(X_test)

In [29]:
from sklearn.ensemble import RandomForestClassifier

In [30]:
RF = RandomForestClassifier()

In [31]:
RF.fit(X_train_prep, y_train)

RandomForestClassifier()

In [32]:
RF.score(X_test_prep, y_test)

0.8156424581005587

In [33]:
pipeline = Pipeline([
    ("prep", preprocessor),
    ("algo", RandomForestClassifier())
])

In [34]:
X_train.head()

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
692       3    male   NaN      0      0   56.4958        S
481       2    male   NaN      0      0    0.0000        S
527       1    male   NaN      0      0  221.7792        S
855       3  female  18.0      0      1    9.3500        S
801       2  female  31.0      1      1   26.2500        S

In [35]:
model = RandomForestClassifier()

In [36]:
# model.fit(X_train, y_train)

In [37]:
pipeline.fit(X_train, y_train)

Pipeline(steps=[('prep',
                 ColumnTransformer(transformers=[('numeric',
                                                  Pipeline(steps=[('imputer',
                                                                   SimpleImputer()),
                                                                  ('scaler',
                                                                   RobustScaler())]),
                                                  ['Age', 'SibSp', 'Parch',
                                                   'Fare']),
                                                 ('categorical',
                                                  Pipeline(steps=[('imputer',
                                                                   SimpleImputer(strategy='most_frequent')),
                                                                  ('encoder',
                                                                   OneHotEncoder())]),
                                                  ['Sex', 'Embarked',
                                                   'Pclass'])])),
                ('algo', RandomForestClassifier())])

In [38]:
pipeline.score(X_test, y_test)

0.8212290502793296

In [39]:
X_train.head()

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
692       3    male   NaN      0      0   56.4958        S
481       2    male   NaN      0      0    0.0000        S
527       1    male   NaN      0      0  221.7792        S
855       3  female  18.0      0      1    9.3500        S
801       2  female  31.0      1      1   26.2500        S

In [40]:
from sklearn.preprocessing import PolynomialFeatures

In [41]:
numerical_pipeline = Pipeline([
    ('imputer', SimpleImputer(strategy='mean')),
    ("poli", PolynomialFeatures(degree=2))
])


categorical_pipeline = Pipeline([
    ('imputer', SimpleImputer(strategy='most_frequent')),
    ('encoder', OneHotEncoder())
])

preprocessor = ColumnTransformer([
    ('numeric', numerical_pipeline, num_columns),
    ('categorical', categorical_pipeline, cat_columns)
])

pipe_RF = Pipeline([
    ("prep", preprocessor),
    ("algo", RandomForestClassifier())
])

In [42]:
from sklearn.neighbors import KNeighborsClassifier

In [43]:
numerical_pipeline = Pipeline([
    ('imputer', SimpleImputer(strategy='mean')),
    ('scaler', RobustScaler())
])


categorical_pipeline = Pipeline([
    ('imputer', SimpleImputer(strategy='most_frequent')),
    ('encoder', OneHotEncoder())
])

preprocessor = ColumnTransformer([
    ('numeric', numerical_pipeline, num_columns),
    ('categorical', categorical_pipeline, cat_columns)
])

pipe_KNN = Pipeline([
    ("prep", preprocessor),
    ("algo", KNeighborsClassifier())
])

In [44]:
X_train.head()

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
692       3    male   NaN      0      0   56.4958        S
481       2    male   NaN      0      0    0.0000        S
527       1    male   NaN      0      0  221.7792        S
855       3  female  18.0      0      1    9.3500        S
801       2  female  31.0      1      1   26.2500        S

In [45]:
data_eric = {
    "nama" : "Eric",
    "Pclass" : 2,
    "Sex" : "male",
    "Age" : 28,
    "SibSp" : 2,
    "Parch" : 2,
    "Fare" : 58,
    "Embarked" : "S",
    "Email" : "eric@titanic.com"
}S

In [46]:
eric = pd.DataFrame(data_eric, index=[1])

In [47]:
eric

   nama  Pclass   Sex  Age  SibSp  Parch  Fare Embarked             Email
1  Eric       2  male   28      2      2    58        S  eric@titanic.com

In [48]:
pipe_RF.fit(X_train, y_train)

Pipeline(steps=[('prep',
                 ColumnTransformer(transformers=[('numeric',
                                                  Pipeline(steps=[('imputer',
                                                                   SimpleImputer()),
                                                                  ('poli',
                                                                   PolynomialFeatures())]),
                                                  ['Age', 'SibSp', 'Parch',
                                                   'Fare']),
                                                 ('categorical',
                                                  Pipeline(steps=[('imputer',
                                                                   SimpleImputer(strategy='most_frequent')),
                                                                  ('encoder',
                                                                   OneHotEncoder())]),
                                                  ['Sex', 'Embarked',
                                                   'Pclass'])])),
                ('algo', RandomForestClassifier())])

In [49]:
eric

   nama  Pclass   Sex  Age  SibSp  Parch  Fare Embarked             Email
1  Eric       2  male   28      2      2    58        S  eric@titanic.com

In [50]:
pipe_RF.predict(eric)[0]

0